const { createCanvas, loadImage } = require('canvas');
const Command = require('../classes/Command.js');
const { MessageAttachment } = require('discord.js')
const { ChannelType } = require('discord.js')
const log = require('../classes/Logger.js');
const { fillRectRadius } = require('../utils/canvasUtils.js');
const { groundChannel } = require('../utils/channelsUtils.js');
const fetch = require('node-fetch');
const { stringAndNumsFormat, checkAndConvertOfType } = require('../utils/stringAndNumsFormat.js');
const ArithmeticExpressions = require('../classes/ArithmeticExpressions.js');


const test = new Command(client, {
    name: 'test',
    description: 'Тестова команда',
    ownerOnly: true,
    adminOnly: false,
    enable: true
}, async (client, message, args) => {
    const msg = await message.channel.fetch(1128802606861533225)

    message.channel.send({embeds: [{
        title: 'Правила',
        color: 0x004B4B,
        fields: [{
            name: '_-|Контент|-_',
            value: `\`1)\` Заборонено контент 18+. Покарання: бан
            \`2)\` Заборонено флуд. Новачків, які флудять, караємо баном
            \`3)\` Заборонено розповсюдження конфіденційної та чутливої інформації інших людей, без їх дозволу
            \`4)\` Заборонено поширювати потенційно шкідливий та просто шкідливий чи небезпечний софт (віруси) та чіти для ігор. Покарання: бан
            \`5)\` Заборонені непристойні чи провокативні ніки (гітлер, сталін і т.д.)
            \`6)\` На цьому сервері є тематичні текстові канали. Потрібно відправляйти повідомлення у відповідні канали в залежності від вмісту повідомлення. 
            А також створювати гілки якщо відповідей на повідомлення буде більше ніж дві. Назва і опис кожного текстового каналу однозначно вказує, для якого вмісту він створений. При порушенні і відхилення прохання видалити нерелевантне повідомлення - видається роль <@&740530014000513114> після порушення у другий раз видається мут у тому каналі де було скоєно порушення..
            
            ㅤ`
        },{
            name: '_-|Реклама|-_',
            value: `\`1)\` Заборонено розповсюджувати рекламу без дозволу <@&704385440391626782> або <@&704384928451919884>. Рекламою вважається посилання на інші спільноти будь яких соціальних мереж, блогів
            \`2)\` Винятком є \`YouTube\` канали, пов'язані із популяризацією культури, історії, політичного контенту чи науки українською. Такі канали можна поширювати в каналі <#704388054928064652>
            \`3)\` Якщо ви бажаєте запропонувати рекламу - звертайтесь до адміністраторів: <@&704384928451919884>, <@&704385440391626782>, <@&883975383370850364>
            
            ㅤ`
        },{
            name: '_-|Булінг|-_',
            value: `\`1)\` Не принижуйте особисту честь і гідність інших учасників без вагомої причини і без належного обґрунтування. При особливо злісному порушенні карається баном
            \`2)\` Заборонено дискримінувати кого-небудь на основі будь-якої різниці особистостей (раса, стать і т.д.) (окрім росіян. Їх треба булити).
            
            ㅤ`
        },{
            name: '_-|Політика|-_',
            value: `\`1)\` Заборонена підтримка РФ. Покарання: бан 
            \`2)\` За непризнання агресії РФ в бік України, окупацію нею українських земель карається баном
            \`3)\` Поширення злісних російських пропагандистських тезисів. Покарання: попередження, бан`
        }]
    }]})
})

module.exports = test;